{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.3.1", "config": {"layers": [{"class_name": "Conv3D", "config": {"dtype": "float32", "dilation_rate": [1, 1, 1], "trainable": true, "strides": [1, 1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "batch_input_shape": [null, 20, 122, 122, 2], "kernel_size": [3, 3, 3], "name": "conv3d_1", "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "filters": 4, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "Conv3D", "config": {"dtype": "float32", "dilation_rate": [1, 1, 1], "trainable": true, "strides": [1, 1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "name": "conv3d_2", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3, 3], "data_format": "channels_last", "kernel_regularizer": null, "filters": 8, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "MaxPooling3D", "config": {"dtype": "float32", "trainable": true, "strides": [2, 2, 2], "padding": "valid", "name": "max_pooling3d_1", "pool_size": [2, 2, 2], "data_format": "channels_last"}}, {"class_name": "Conv3D", "config": {"dtype": "float32", "dilation_rate": [1, 1, 1], "trainable": true, "strides": [1, 1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "name": "conv3d_3", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3, 3], "data_format": "channels_last", "kernel_regularizer": null, "filters": 16, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "Conv3D", "config": {"dtype": "float32", "dilation_rate": [1, 1, 1], "trainable": true, "strides": [1, 1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "name": "conv3d_4", "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3, 3], "data_format": "channels_last", "kernel_regularizer": null, "filters": 32, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_1", "axis": -1, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling3D", "config": {"dtype": "float32", "trainable": true, "strides": [2, 2, 2], "padding": "valid", "name": "max_pooling3d_2", "pool_size": [2, 2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"dtype": "float32", "trainable": true, "noise_shape": null, "rate": 0.25, "seed": null, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"dtype": "float32", "trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"dtype": "float32", "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 2098, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "Dropout", "config": {"dtype": "float32", "trainable": true, "noise_shape": null, "rate": 0.5, "seed": null, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"dtype": "float32", "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 412, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "Dropout", "config": {"dtype": "float32", "trainable": true, "noise_shape": null, "rate": 0.5, "seed": null, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"dtype": "float32", "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 1, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}], "name": "sequential_1"}}